{"inkVersion":21,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"student_cubes":["#","^---","/#","#","^choiceLabel: Go to the student cubicles.","/#","#","^hidden: true","/#","#","^tags: location","/#","#","^===","/#",{"->":"SceneStart"},{"#f":1}],"SceneStart":[["^With your survey approved, you start to pack up and head home to work more on your paper. However, as you start to walk away Ivy flags you down.","\n","^Ivy: \"Bronislav! Did your survey get accepted?\"","\n","ev","str","^\"It did.\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n","^Bronislav: \"It sure did. I was just about to go home and start working more on the paper.\"","\n",{"->":"Proposition"},{"#f":5}]}],{"#f":1}],"Proposition":[["^Ivy smiles cheerfully.","\n","^\"Great to hear. I do have a proposition for you Bronislav.\"","\n","ev","str","^\"What's that?\"","/str","/ev",{"*":".^.c-0","flg":20},{"c-0":["\n",{"->":"PropInfo"},{"#f":5}]}],{"#f":1}],"PropInfo":[["^Bronislav: \"What is your proposition?\"","\n","^Ivy: \"My uncle works at a prestigious research firm, and they've been looking for a graduate student with your skillset.\"","\n","ev","str","^\"That sounds great! What would I need to do?\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"How so?\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"This is a proposition how?\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"TheCatch"},"^Ivy:\"I know you've been on the fence about Jensen, but if you can get him on that paper I can help your career out a bit too.\"","\n",{"#f":5}],"c-1":["\n",{"->":"TheCatch"},"^Ivy: \"My uncle has been looking for someone to add to his firm with good mentorship skills. Being able to teach someone less knowledgeable than yourself is a useful skill Bronislav.\"","\n",{"#f":5}],"c-2":["\n",{"->":"TheCatch"},{"#f":5}]}],{"#f":1}],"TheCatch":[["^Bronislav:\"That sounds great Ivy! Is there anything I need to do to contact him?\"","\n","^Ivy: \"I can definitely put in a good word for you with him. All you need to do is add Jensen to your paper, and you've got yourself a deal.\"","\n","^Ivy: \"In exchange for putting Jensen on your paper, I can talk to my uncle who works at a research firm who have been looking for a new hire. So, what do you think?\"","\n","^Ivy: \"Add Jensen to that paper Bronislav. Do that and I can talk with my uncle and put in a good word for you.\"","\n","ev","str","^\"That's it? Of course!\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"I'm not sure yet.\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"That is textbook quid pro quo.\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"AcceptingDeal"},{"#f":5}],"c-1":["\n",{"->":"Unsure"},{"#f":5}],"c-2":["\n",{"->":"DenyDeal"},{"#f":5}]}],{"#f":1}],"AcceptingDeal":["^Bronislav: \"That's it? You've got yourself a deal Ivy!\"","\n","^You shake her hand.","\n","^Ivy: \"Incredible. I'll talk with my uncle ASAP and get back to you about that job.\"","\n",{"->":"Continue"},{"#f":1}],"Unsure":["^Bronislav: \"Sounds a bit fishy, I'm not quite sure yet. Let me think about it some more.\"","\n","^Ivy shakes her head.","\n","^Ivy: \"Ok, but opportunities like these don't come around often.\"","\n",{"->":"Continue"},{"#f":1}],"DenyDeal":["^Bronislav: \"Ivy that is textbook quid pro quo, my reputation would go down the drain.\"","\n","^Ivy frowns and grows annoyed,","\n","^Ivy: \"Have it your way Bronislav. Won't get an opportunity like that ever again.\"","\n",{"->":"Continue"},{"#f":1}],"Continue":["^Ivy packs her stuff up, smiling as usual. Quite the exciting prospect, getting connections in such a high place. However, if you get caught your reputation can be devalued greatly.","\n","^Ivy: \"You know where to reach me if you change your mind.\"","\n","^Ivy packs her stuff up and leaves. As great of an opportunity that would be for your career, can you run the risk of getting caught?","\n","^Ivy leaves angrily. She is somewhat right, opportunities like that are rare. However, integrity is priceless.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}