{"inkVersion":21,"root":[[["done",{"#f":5,"#n":"g-0"}],null],"done",{"student_cubes":["#","^---","/#","#","^choiceLabel: Go to the student cubicles.","/#","#","^hidden: true","/#","#","^tags: location","/#","#","^===","/#",{"->":"SceneStart"},{"#f":1}],"SceneStart":[["^While you are crunching away at your paper, Ivy approaches you.","\n","^Ivy: \"Hey Bronislav. I know you said you'd put Jensen on the paper. If that's still on the table, allow me to explain my proposal. I've been talking to my uncle about you and I could arrange a meeting with him as well as a recommendation if you put Jensen on the paper. He's excited to meet you, so please, think about it.\"","\n","ev","str","^\"Thanks Ivy.\" ","#","^>> IncrementRelationshipStat Ivy Bronislav Opinion 50","/#","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"I've changed my mind.\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"I'm not sure yet.\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ","\n",{"->":"ThanksIvy"},{"#f":5}],"c-1":["\n",{"->":"ChangedMyMind"},{"#f":5}],"c-2":["\n",{"->":"NotSureYet"},{"#f":5}]}],{"#f":1}],"ThanksIvy":["^Bronislav: \"That's really generous of you. Thank you Ivy. If I get this done in time, I'll be heavily considering adding him to the paper.\"","\n","^Ivy: \"Yeah, I just hope Jensen can get into grad school with this and a few more papers under his belt. It's really important to him.\"","\n","done",{"#f":1}],"ChangedMyMind":[["^Bronislav: \"I'm actually leaning towards no on this, now. I don't feel as though Jensen's feedback is enough now, and with a generous offer from you on the table like this, I think it would be too risky for the both of us.\"","\n","^Ivy: \"Aw, c'mon Bronislav, you know how hard it is to get into Grad School.\"","\n","^Ivy sighs.","\n","^Ivy: \"Jensen needs all the help he can get, wouldn't you have liked help like this back then?\"","\n","ev","str","^\"You're right.\" ","#","^>> IncrementRelationshipStat Ivy Bronislav Opinion 50","/#","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"It's hard, but...\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"This is Jensen, not me.\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"YouAreRight"},{"#f":5}],"c-1":["\n",{"->":"ItsHardBut"},{"#f":5}],"c-2":["\n",{"->":"JensenNotMe"},{"#f":5}]}],{"#f":1}],"YouAreRight":["^Bronislav: \"You're right, I would have liked this help back then. I'll mull it over some more, Ivy. You had a rough time getting into grad school too, right? That's why you're sympathizing with Jensen?\"","\n","^Ivy starts to smile, relieved by this turn of events.","\n","^Ivy: \"Yeah, it was a struggle getting onto papers, and I feel like Jensen needs the help. Thank you for mulling it over, Bronislav, I've got to go.\"","\n","done",{"#f":1}],"ItsHardBut":["^Bronislav: \"It is hard, but I feel like Jensen really just isn't going to hold up to review. His feedback was basic, we'd get caught...\"","\n","^Ivy interrupts you, clearly you hit a nerve.","\n","^Ivy: \"Look, if you pull this off, I'll give you that recommendation to my uncle's place. Don't disapoint him.\" She walks off with a huff.","\n","done",{"#f":1}],"JensenNotMe":["^Bronislav: \"This is Jensen, not me, Ivy. I worked so hard to get in and he's nowhere near my level that I was when I was his age. The feedback I got from him was the most basic possible, I don't feel like it would hold up.\"","\n","^Ivy frowns, looking peeved.","\n","^Ivy: \"Yeah, but what if it does? Jensen would have his credit, and you would have a recommendation to a job at my Uncle's place.\"","\n","^Ivy sighs, shaking her head.","\n","^Ivy: \"Look, just think it over, okay? He's in the same place you were years ago, he may not be 'on your level' or whatever, but he's trying his hardest.\"","\n","^Ivy turns away, heading out.","\n","done",{"#f":1}],"NotSureYet":[["^Bronislav: \"Look, I'm not sure yet Ivy...\"","\n","^You hesitantly speak up.","\n","^Ivy:\"Not sure yet? Things are getting a bit close for authorship, Bronislav.\"","\n","^Ivy: \"Look, you get Jensen on that paper and I'll see what I can do about getting you that recommendation.\"","\n","^With that, Ivy waves goodbye to you and walks off.","\n","done","^Ivy: \"Hey Bronislav, last time we talked you were really helpful with Jensen. I want to make sure you follow through on that, so I've got an offer for you.\"","\n","^Ivy: \"If you put Jensen on the paper, I'll recommend you to my uncle's place and see about getting him to meet you.\"","\n","ev","str","^\"That's relly helpful.\"  ","#","^>> IncrementRelationshipStat Ivy Bronislav Opinion 50","/#","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"Thanks, but are you sure?\" ","#","^>> IncrementRelationshipStat Ivy Bronislav Opinion 20","/#","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^I'm not sure about this?\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"ThatsReallyHelpful"},{"#f":5}],"c-1":["\n",{"->":"YouSure"},{"#f":5}],"c-2":["\n",{"->":"ImNotSure"},{"#f":5}]}],{"#f":1}],"ThatsReallyHelpful":["^Bronislav: \"That's really helpful, Ivy, I'll need to see how the paper turns out first but if I keep it together, I'm leaning towards putting Jenson on the paper.\"","\n","^Ivy smiles, pleased by this.","\n","^Ivy: \"Thank you Bronislav, Jensen really needs the help getting into grad school, it's nice to see you being so supportive.\"","\n","^Ivy: \"I'll keep in touch, hope to see you again soon!\"","\n","^Ivy walks off with a pleased pep in her step.","\n","done",{"#f":1}],"YouSure":["^Bronislav: \"Thank you, Ivy, but are you sure? That's really generous of you but you're kind of sticking your neck out for me on this one.\"","\n","^Ivy cracks a smile at that.","\n","^Ivy: \"I wouldn't be too worried, you're doing great. If you hold up your end of the bargain, it'll be worth it.\"","\n","^Ivy: \"I'll keep in touch, hope to see you again soon!\"","\n","^Ivy walks off with a pleased pep in her step.","\n","done",{"#f":1}],"ImNotSure":[["^Bronislav: \"I'm not sure about this, Ivy. Now that there's an explicit deal on the table, it feels...\"","\n","^You try to come up with the words, your altruistic intentions to help Jensen feeling conflicted with your need for a job.","\n","^Ivy: \"Hey, no big deal. Just think it over while you're working here, Bronislav.\"","\n","^Ivy waves goodbye, taking her leave briskly.","\n","done","^Ivy: \"Hey, Bronislav. I know you were not having it last time when we discussed Jensen.\"","\n","^She looks dejected.","\n","^Ivy: \"So, this time around, I've got a deal for you. You put Jensen on the paper, and I'll see about getting you a job at my uncle's place. Any thoughts?\"","\n","ev","str","^\"I'm sorry about what I said.\"","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^\"That won't help.\"","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^\"No way.\"","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["\n",{"->":"SorryAbtThat"},{"#f":5}],"c-1":["\n",{"->":"ThatWontHelp"},{"#f":5}],"c-2":["\n",{"->":"NoWay"},{"#f":5}]}],{"#f":1}],"SorryAbtThat":["^Bronislav: \"I'm sorry about what I said regarding Jensen. I'm sure he's a fine guy, he just rubbed me wrong when we first met. I think I'll be putting him on the paper.\"","\n","^Ivy looks slightly relieved.","\n","^Ivy: \"That actually means a lot to hear you say that, Bronislav. Jensen really needs it, as you've clearly noticed.\"","\n","^With the slight bit of sass, she continues.","\n","^Ivy: \"For now, keep mulling it over, and be a bit nicer to poor Jensen from now on.\"","\n","^Ivy walks away, not even waving goodbye.","\n","done",{"#f":1}],"ThatWontHelp":["^Bronislav: \"Look, it won't really help with how the feedback from Jensen is.\"","\n","^You grimace a little.","\n","^Bronislav: \"As enticing as a job recommendation is, Jensen's feedback is iffy.\"","\n","^Ivy frowns.","\n","^Ivy: \"Bronislav, you know how much help he needs. Please. Think about it.\"","\n","^Ivy: \"I know it might be hard, but you're struggling with gettting a job. Mull it over.\"","\n","^Ivy waves goodbye and leaves without another word.","\n","done",{"#f":1}],"NoWay":["^Bronislav: \"No way for now, Jensen needs to step it up a notch if he wants my help. We would get caught instantly.\"","\n","^Ivy: \"C'mon Bronislav, this is a big oppurtunity for you if you just add him to the paper. You're missing out on a lot.\"","\n","^Ivy frowns and turns away.","\n","^Ivy: \"Think it over, okay?\"","\n","^Ivy leaves wordlessly.","\n","done",{"#f":1}],"#f":1}],"listDefs":{}}